#Создать список из десяти целых чисел.Вывести на экран каждое число, увеличенное на 1.
x=1
while x<=10:
	print(x)
	x+=1